backend/app/models/user.rb

    def self.pets_of_email(email)
        pets = []
        User.where(email: email).each do |user|
---
SELECT "users".* FROM "users" WHERE "users"."email" = ?  [["email", "ron@gmail.com"]]