backend/app/controllers/pets_controller.rb

    def index
        @pets = Pet.all
---
SELECT "pets".* FROM "pets" WHERE "pets"."created_at" BETWEEN ? AND ?  [["created_at", "2020-02-13 00:00:00"], ["created_at", "2020-04-14 23:59:59.999999"]]