backend/app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."category" = ?  [["category", "\"dog\""]]
---
    def index
        # localhost:3000/pets?category=dog
        # localhost:3000/pets?email=ron@gmail.com
        if params[:email]
            @pets = User.pets_of_email(params[:email])
        elsif params[:category]
            @pets = Pet.where(category: params[:category])